from sys import stdout
from colorama import Fore, init
import os

def home_page():
        os.system("clear")
        stdout.write("\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╭━━╮╱╱╱╱╱╭╮╱╱╱╭╮╭━╮╭╮╭╮╱╱╭━━━┳╮╱╱╭━━╮                                   ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╰┫┣╯╱╱╱╱╭╯╰╮╱╱┃┃┃╭╯┃┃┃┃╱╱┃╭━╮┃┃╱╱╰┫┣╯                                   ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╱┃┃╭━╮╭━┻╮╭╋━━┫╰╯╯╭┫┃┃┃╱╱┃┃╱╰┫┃╱╱╱┃┃    Author's Web-Site: TheWind.uz   ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╱┃┃┃╭╮┫━━┫┃┃╭╮┃╭╮┃┣┫┃┃┣━━┫┃╱╭┫┃╱╭╮┃┃    Study Platform: HackNow.uz      ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╭┫┣┫┃┃┣━━┃╰┫╭╮┃┃┃╰┫┃╰┫╰┳━┫╰━╯┃╰━╯┣┫┣╮                                   ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"             ╰━━┻╯╰┻━━┻━┻╯╰┻╯╰━┻┻━┻━╯╱╰━━━┻━━━┻━━╯                                   ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"    .____________________________________________________|_._._._._._._._._._.       ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"   /_____________________________________________________|_#_#_#_#_#_#_#_#_#_|       ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"                𝕻𝖗𝖔𝖌𝖗𝖆𝖒𝖒𝖊𝖉 𝖇𝖞 𝕬𝖐𝖍𝖆𝖙𝖐𝖚𝖑𝖔𝖛                 l                           ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"                                                                                     ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"⮜═════════════════════════════════════════════════════════════════════════════════⮞  ┃\n")
        stdout.write("\n")
        stdout.write("                  ┃ "+Fore.RED   +"╔═════════════════════════════════════╦════════════════════════════════════════════╗ ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"║   App's Target                      ║  Auto Account Spammer for Instagram        ║ ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"║═════════════════════════════════════╬════════════════════════════════════════════║ ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"║   Author                            ║  Akhatkulov/Rahmankulov                    ║ ┃\n")        
        stdout.write("                  ┃ "+Fore.RED   +"║═════════════════════════════════════╬════════════════════════════════════════════║ ┃\n")
        stdout.write("                  ┃ "+Fore.RED   +"║   Guide                             ║  In README.md                              ║ ┃\n") 
        stdout.write("                  ┃ "+Fore.RED   +"║═════════════════════════════════════╬════════════════════════════════════════════║ ┃\n")   # github.com/akhatkulov/InstaCracker-CLI
        stdout.write("                  ┃ "+Fore.RED   +"║   Github                            ║  github.com/akhatkulov/InstaKill-CLI       ║ ┃\n") 
        stdout.write("                  ┃ "+Fore.RED   +"╚═════════════════════════════════════╩════════════════════════════════════════════╝ ┃\n")

home_page()